tap "homebrew/bundle"
tap "homebrew/services"
brew "bash-completion"
brew "bat"
brew "btop"
brew "cairo"
brew "choose-rust"
brew "cmake"
brew "curl"
brew "doggo"
brew "dpkg"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "g-ls"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "graphviz"
brew "gtk+"
brew "help2man"
brew "hyperfine"
brew "jq"
brew "just"
brew "lsd"
brew "mysql", restart_service: true
brew "node"
brew "pinentry-mac"
brew "poppler"
brew "prettier"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust"
brew "sox"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "upx"
brew "vivid"
brew "wget"
brew "zoxide"
vscode "adpyke.codesnap"
vscode "alexkainzinger.resource-watchdog"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "astro-build.astro-vscode"
vscode "buuug7.gbk2utf8"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "chiehyu.vscode-astyle"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.vscode-office"
vscode "davidbwaters.macos-modern-theme"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fernandoescolar.vscode-solution-explorer"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "hoovercj.vscode-power-mode"
vscode "kevinrose.vsc-python-indent"
vscode "maixiaojie.git-emoji-zh"
vscode "mathematic.vscode-latex"
vscode "mcu-debug.peripheral-viewer"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "rust-lang.rust-analyzer"
vscode "skellock.just"
vscode "stephtr.git-identity"
vscode "streetsidesoftware.code-spell-checker"
vscode "techer.open-in-browser"
vscode "ultram4rine.vscode-choosealicense"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "w88975.code-translate"
vscode "wakatime.vscode-wakatime"
vscode "xshrim.txt-syntax"
vscode "xyz.local-history"
vscode "zhuangtongfa.material-theme"
